In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config.ini')

host = config['myaws']['host']
user = config['myaws']['user']
pwsd = config['myaws']['pwsd']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect(
host = host,
user = user,
password = pwsd,
dbname = database
)

In [5]:
cur= conn.cursor()

In [6]:
sql_statement = '''
                select * from student_gp13 
                '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

('williumsd@dukes.jmu.edu                                                                             ',
 "D'Marcus Williums                                                                                   ",
 'ia                  ')

# Q 1

In [9]:
for result in cur.fetchall():
    print(result)

('kingt@dukes.jmu.edu                                                                                 ', "T'varisuness King                                                                                   ", 'ia                  ')
('tacktheritrixj@dukes.jmu.edu                                                                        ', 'Jackmerius Tacktheritrix                                                                            ', 'ia                  ')
('mccringleberryh@dukes.jmu.edu                                                                       ', 'Hingle McCringleberry                                                                               ', 'ia                  ')
('moizoosi@dukes.jmu.edu                                                                              ', 'Ibrahim Moizoos                                                                                     ', 'ia                  ')
('demo_email                                                                                          ', 'demo_name                                                                                           ', 'GS                  ')

In [10]:
df = pandas.read_sql_query(sql_statement,conn)
df[:]

,email,name,major
0,williumsd@dukes.jmu.edu ...,D'Marcus Williums ...,ia
1,kingt@dukes.jmu.edu ...,T'varisuness King ...,ia
2,tacktheritrixj@dukes.jmu.edu ...,Jackmerius Tacktheritrix ...,ia
3,mccringleberryh@dukes.jmu.edu ...,Hingle McCringleberry ...,ia
4,moizoosi@dukes.jmu.edu ...,Ibrahim Moizoos ...,ia
5,demo_email ...,demo_name ...,GS

# Q 2

In [11]:
sql_statement = '''
                select
                cname,
                count(semail)
  
                from enroll_gp13
                group by cname
                order by count(semail) desc
                limit 1
                '''

df = pandas.read_sql_query(sql_statement,conn)
df[:10]

                                               cname  count
0  IA 210                                        ...      1

each course has one student enrolled

# Q 3

In [12]:
sql_insert_statement = '''
select 
*
from teacher_gp13
inner join course_gp13
on teacher_gp13.email = course_gp13.temail'''


df = pandas.read_sql_query(sql_insert_statement,conn)
df[:]

,email,name,office,name,room,temail
0,madisonj@jmu.edu ...,james madison ...,isat110,IA 261 ...,engeo2011,madisonj@jmu.edu ...
1,moore8ka@jmu.edu ...,kathleen moore ...,isat116,IA 240 ...,engeo2010,moore8ka@jmu.edu ...
2,taoqx@jmu.edu ...,qingjiu tao ...,engeo2107,IA 210 ...,engeo1210,taoqx@jmu.edu ...
3,raabrw@jmu.edu ...,ron raaab ...,isat156,IA 460 ...,isat326,raabrw@jmu.edu ...
4,madisonj@jmu.edu ...,james madison ...,isat110,IA241 ...,isat110,madisonj@jmu.edu ...
5,madisonj@jmu.edu ...,james madison ...,isat110,IA 200 ...,engeo2210,madisonj@jmu.edu ...

# Q 4

In [13]:
sql_insert_statement = '''
select  
teacher_gp13.name as tname,
count(course_gp13.name) as course_num
from teacher_gp13
inner join course_gp13
on teacher_gp13.email = course_gp13.temail
group by teacher_gp13.name'''

df = pandas.read_sql_query(sql_insert_statement,conn)
df[:]

                                               tname  course_num
0  james madison                                 ...           3
1  qingjiu tao                                   ...           1
2  ron raaab                                     ...           1
3  kathleen moore                                ...           1

# Q 5

In [14]:
sql_insert_statement = '''
                        insert into teacher_gp13(email,name,office)
                        values('{}','{}','{}')
                        '''.format('new_email6','new_name1','new_office3')
print(sql_insert_statement)

                        insert into teacher_gp13(email,name,office)
                        values('new_email6','new_name1','new_office3')

In [22]:
cur.execute(sql_insert_statement)

ForeignKeyViolation: insert or update on table "course_gp13" violates foreign key constraint "course_gp13_temail_fkey"
DETAIL:  Key (temail)=(new_temail6                                                                                         ) is not present in table "teacher_gp13".

In [16]:
conn.commit()

In [17]:
df = pandas.read_sql_query('''select * from teacher_gp13''',conn)
df[:]

,email,name,office
0,moore8ka@jmu.edu ...,kathleen moore ...,isat116
1,raabrw@jmu.edu ...,ron raaab ...,isat156
2,taoqx@jmu.edu ...,qingjiu tao ...,engeo2107
3,waltontr@jmu.edu ...,timothy walton ...,isat326
4,madisonj@jmu.edu ...,james madison ...,isat110
5,new_email1 ...,new_name1 ...,new_office1
6,new_email6 ...,new_name1 ...,new_office3

In [21]:
sql_insert_statement = '''
                        insert into course_gp13(name,room,temail)
                        values('{}','{}','{}')
                        '''.format('new_name10','new_room10','new_temail6')
print(sql_insert_statement)

                        insert into course_gp13(name,room,temail)
                        values('new_name10','new_room10','new_temail6')

In [20]:
cur.execute(sql_insert_statement)
conn.commit()
df = pandas.read_sql_query('''select * from course_gp13''',conn)
df[:]

,name,room,temail
0,IA 261 ...,engeo2011,madisonj@jmu.edu ...
1,IA 240 ...,engeo2010,moore8ka@jmu.edu ...
2,IA 210 ...,engeo1210,taoqx@jmu.edu ...
3,IA 460 ...,isat326,raabrw@jmu.edu ...
4,IA241 ...,isat110,madisonj@jmu.edu ...
5,IA 200 ...,engeo2210,madisonj@jmu.edu ...

# Q 6

In [19]:
sql_insert_statement = '''
 
update course_gp13
set temail = 'madisonj@jmu.edu'
where temail = 'waltontr@jmu.edu'
 '''
cur.execute(sql_insert_statement)

conn.commit()

df = pandas.read_sql_query("""select * from course_gp13""",conn)
df[:]

,name,room,temail
0,IA 261 ...,engeo2011,madisonj@jmu.edu ...
1,IA 240 ...,engeo2010,moore8ka@jmu.edu ...
2,IA 210 ...,engeo1210,taoqx@jmu.edu ...
3,IA 460 ...,isat326,raabrw@jmu.edu ...
4,IA241 ...,isat110,madisonj@jmu.edu ...
5,IA 200 ...,engeo2210,madisonj@jmu.edu ...

In [23]:
cur.close()
conn.close()